---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoFittingInProjectWarning
source: html/49310dcf-7b89-2462-75b6-6b150f84adb6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoFittingInProjectWarning Property

The routing solution failed because there is no default fitting type specified or the fitting cannot be found in the project.
 Ensure the fitting is loaded in the project and try again.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoFittingInProjectWarning { get; }
```